; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=85, out_folder=htg/blocksworld/training, instance_id=65, seed=2089, goal_proportion=0.1

(define (problem blocksworld-65)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b6)
    (on b6 b44)
    (on-table b44)
    (clear b1)
    (on b1 b35)
    (on-table b35)
    (clear b37)
    (on b37 b56)
    (on b56 b32)
    (on-table b32)
    (clear b83)
    (on-table b83)
    (clear b29)
    (on b29 b85)
    (on b85 b48)
    (on b48 b47)
    (on b47 b30)
    (on-table b30)
    (clear b80)
    (on b80 b74)
    (on b74 b59)
    (on b59 b67)
    (on b67 b62)
    (on b62 b20)
    (on b20 b65)
    (on b65 b41)
    (on b41 b14)
    (on b14 b34)
    (on b34 b61)
    (on b61 b12)
    (on b12 b3)
    (on b3 b77)
    (on b77 b38)
    (on-table b38)
    (clear b64)
    (on b64 b75)
    (on b75 b42)
    (on b42 b72)
    (on b72 b8)
    (on b8 b66)
    (on-table b66)
    (clear b40)
    (on b40 b33)
    (on b33 b55)
    (on b55 b21)
    (on b21 b57)
    (on b57 b26)
    (on b26 b5)
    (on b5 b31)
    (on b31 b82)
    (on b82 b24)
    (on b24 b4)
    (on b4 b2)
    (on b2 b71)
    (on b71 b22)
    (on b22 b63)
    (on b63 b10)
    (on b10 b15)
    (on b15 b76)
    (on b76 b39)
    (on b39 b7)
    (on b7 b79)
    (on b79 b54)
    (on-table b54)
    (clear b52)
    (on b52 b51)
    (on b51 b27)
    (on-table b27)
    (clear b78)
    (on b78 b69)
    (on b69 b43)
    (on b43 b17)
    (on b17 b50)
    (on b50 b58)
    (on b58 b18)
    (on b18 b45)
    (on b45 b28)
    (on b28 b11)
    (on b11 b60)
    (on b60 b19)
    (on b19 b25)
    (on b25 b53)
    (on b53 b36)
    (on b36 b9)
    (on-table b9)
    (clear b81)
    (on b81 b46)
    (on b46 b70)
    (on b70 b73)
    (on b73 b84)
    (on b84 b23)
    (on b23 b68)
    (on b68 b16)
    (on b16 b49)
    (on-table b49))
 (:goal  (and 
    (clear b3)
    (on b3 b4)
    (on b4 b5)
    (on b5 b1)
    (on b1 b8)
    (on b8 b6)
    (on b6 b2)
    (on b2 b7)
    (on-table b7))))

; plan
1. (unstack b64 b75)
   deleted: (on b64 b75) (clear b64) (arm-empty)
   added: (holding b64) (clear b75)
   goals met: 0 of 9
2. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 0 of 9
3. (unstack b75 b42)
   deleted: (on b75 b42) (clear b75) (arm-empty)
   added: (holding b75) (clear b42)
   goals met: 0 of 9
4. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 0 of 9
5. (unstack b42 b72)
   deleted: (on b42 b72) (clear b42) (arm-empty)
   added: (holding b42) (clear b72)
   goals met: 0 of 9
6. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 0 of 9
7. (unstack b72 b8)
   deleted: (on b72 b8) (clear b72) (arm-empty)
   added: (holding b72) (clear b8)
   goals met: 0 of 9
8. (stack b72 b80)
   deleted: (clear b80) (holding b72)
   added: (arm-empty) (clear b72) (on b72 b80)
   goals met: 0 of 9
9. (unstack b1 b35)
   deleted: (on b1 b35) (clear b1) (arm-empty)
   added: (holding b1) (clear b35)
   goals met: 0 of 9
10. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 1 of 9
11. (unstack b40 b33)
   deleted: (on b40 b33) (clear b40) (arm-empty)
   added: (holding b40) (clear b33)
   goals met: 1 of 9
12. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 9
13. (unstack b33 b55)
   deleted: (on b33 b55) (clear b33) (arm-empty)
   added: (holding b33) (clear b55)
   goals met: 1 of 9
14. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 9
15. (unstack b55 b21)
   deleted: (on b55 b21) (clear b55) (arm-empty)
   added: (holding b55) (clear b21)
   goals met: 1 of 9
16. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 1 of 9
17. (unstack b21 b57)
   deleted: (on b21 b57) (clear b21) (arm-empty)
   added: (holding b21) (clear b57)
   goals met: 1 of 9
18. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 9
19. (unstack b57 b26)
   deleted: (on b57 b26) (clear b57) (arm-empty)
   added: (holding b57) (clear b26)
   goals met: 1 of 9
20. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 1 of 9
21. (unstack b26 b5)
   deleted: (on b26 b5) (clear b26) (arm-empty)
   added: (holding b26) (clear b5)
   goals met: 1 of 9
22. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 9
23. (unstack b5 b31)
   deleted: (on b5 b31) (clear b5) (arm-empty)
   added: (holding b5) (clear b31)
   goals met: 1 of 9
24. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 2 of 9
25. (unstack b31 b82)
   deleted: (on b31 b82) (clear b31) (arm-empty)
   added: (holding b31) (clear b82)
   goals met: 2 of 9
26. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 9
27. (unstack b82 b24)
   deleted: (on b82 b24) (clear b82) (arm-empty)
   added: (holding b82) (clear b24)
   goals met: 2 of 9
28. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 2 of 9
29. (unstack b24 b4)
   deleted: (on b24 b4) (clear b24) (arm-empty)
   added: (holding b24) (clear b4)
   goals met: 2 of 9
30. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 2 of 9
31. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 2 of 9
32. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 3 of 9
33. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 3 of 9
34. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 9
35. (unstack b6 b44)
   deleted: (on b6 b44) (clear b6) (arm-empty)
   added: (holding b6) (clear b44)
   goals met: 3 of 9
36. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 4 of 9
37. (unstack b72 b80)
   deleted: (on b72 b80) (clear b72) (arm-empty)
   added: (holding b72) (clear b80)
   goals met: 4 of 9
38. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 4 of 9
39. (unstack b80 b74)
   deleted: (on b80 b74) (clear b80) (arm-empty)
   added: (holding b80) (clear b74)
   goals met: 4 of 9
40. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 4 of 9
41. (unstack b74 b59)
   deleted: (on b74 b59) (clear b74) (arm-empty)
   added: (holding b74) (clear b59)
   goals met: 4 of 9
42. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 4 of 9
43. (unstack b59 b67)
   deleted: (on b59 b67) (clear b59) (arm-empty)
   added: (holding b59) (clear b67)
   goals met: 4 of 9
44. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 4 of 9
45. (unstack b67 b62)
   deleted: (on b67 b62) (clear b67) (arm-empty)
   added: (holding b67) (clear b62)
   goals met: 4 of 9
46. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 4 of 9
47. (unstack b62 b20)
   deleted: (on b62 b20) (clear b62) (arm-empty)
   added: (holding b62) (clear b20)
   goals met: 4 of 9
48. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 4 of 9
49. (unstack b20 b65)
   deleted: (on b20 b65) (clear b20) (arm-empty)
   added: (holding b20) (clear b65)
   goals met: 4 of 9
50. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 9
51. (unstack b65 b41)
   deleted: (on b65 b41) (clear b65) (arm-empty)
   added: (holding b65) (clear b41)
   goals met: 4 of 9
52. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 4 of 9
53. (unstack b41 b14)
   deleted: (on b41 b14) (clear b41) (arm-empty)
   added: (holding b41) (clear b14)
   goals met: 4 of 9
54. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 4 of 9
55. (unstack b14 b34)
   deleted: (on b14 b34) (clear b14) (arm-empty)
   added: (holding b14) (clear b34)
   goals met: 4 of 9
56. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 9
57. (unstack b34 b61)
   deleted: (on b34 b61) (clear b34) (arm-empty)
   added: (holding b34) (clear b61)
   goals met: 4 of 9
58. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 4 of 9
59. (unstack b61 b12)
   deleted: (on b61 b12) (clear b61) (arm-empty)
   added: (holding b61) (clear b12)
   goals met: 4 of 9
60. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 4 of 9
61. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 5 of 9
62. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 9
63. (unstack b3 b77)
   deleted: (on b3 b77) (clear b3) (arm-empty)
   added: (holding b3) (clear b77)
   goals met: 4 of 9
64. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 6 of 9
65. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 5 of 9
66. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 9
67. (unstack b2 b71)
   deleted: (on b2 b71) (clear b2) (arm-empty)
   added: (holding b2) (clear b71)
   goals met: 5 of 9
68. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 9
69. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 9
70. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 6 of 9
71. (unstack b71 b22)
   deleted: (on b71 b22) (clear b71) (arm-empty)
   added: (holding b71) (clear b22)
   goals met: 6 of 9
72. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 6 of 9
73. (unstack b22 b63)
   deleted: (on b22 b63) (clear b22) (arm-empty)
   added: (holding b22) (clear b63)
   goals met: 6 of 9
74. (stack b22 b75)
   deleted: (clear b75) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b75)
   goals met: 6 of 9
75. (unstack b63 b10)
   deleted: (on b63 b10) (clear b63) (arm-empty)
   added: (holding b63) (clear b10)
   goals met: 6 of 9
76. (stack b63 b74)
   deleted: (clear b74) (holding b63)
   added: (arm-empty) (clear b63) (on b63 b74)
   goals met: 6 of 9
77. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 6 of 9
78. (stack b10 b71)
   deleted: (clear b71) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b71)
   goals met: 6 of 9
79. (unstack b15 b76)
   deleted: (on b15 b76) (clear b15) (arm-empty)
   added: (holding b15) (clear b76)
   goals met: 6 of 9
80. (stack b15 b26)
   deleted: (clear b26) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b26)
   goals met: 6 of 9
81. (unstack b76 b39)
   deleted: (on b76 b39) (clear b76) (arm-empty)
   added: (holding b76) (clear b39)
   goals met: 6 of 9
82. (stack b76 b24)
   deleted: (clear b24) (holding b76)
   added: (arm-empty) (clear b76) (on b76 b24)
   goals met: 6 of 9
83. (unstack b39 b7)
   deleted: (on b39 b7) (clear b39) (arm-empty)
   added: (holding b39) (clear b7)
   goals met: 6 of 9
84. (stack b39 b34)
   deleted: (clear b34) (holding b39)
   added: (arm-empty) (clear b39) (on b39 b34)
   goals met: 6 of 9
85. (unstack b7 b79)
   deleted: (on b7 b79) (clear b7) (arm-empty)
   added: (holding b7) (clear b79)
   goals met: 6 of 9
86. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 7 of 9
87. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 6 of 9
88. (stack b6 b14)
   deleted: (clear b14) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b14)
   goals met: 6 of 9
89. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 9
90. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 7 of 9
91. (unstack b6 b14)
   deleted: (on b6 b14) (clear b6) (arm-empty)
   added: (holding b6) (clear b14)
   goals met: 7 of 9
92. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 8 of 9
93. (unstack b3 b4)
   deleted: (on b3 b4) (clear b3) (arm-empty)
   added: (holding b3) (clear b4)
   goals met: 6 of 9
94. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 9
95. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 6 of 9
96. (stack b4 b63)
   deleted: (clear b63) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b63)
   goals met: 6 of 9
97. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 9
98. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 7 of 9
99. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 6 of 9
100. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 9
101. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 5 of 9
102. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 9
103. (unstack b8 b66)
   deleted: (on b8 b66) (clear b8) (arm-empty)
   added: (holding b8) (clear b66)
   goals met: 5 of 9
104. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 6 of 9
105. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 9
106. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 7 of 9
107. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 7 of 9
108. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 9
109. (unstack b3 b4)
   deleted: (on b3 b4) (clear b3) (arm-empty)
   added: (holding b3) (clear b4)
   goals met: 6 of 9
110. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 9
111. (unstack b4 b63)
   deleted: (on b4 b63) (clear b4) (arm-empty)
   added: (holding b4) (clear b63)
   goals met: 7 of 9
112. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 8 of 9
113. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 9
114. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 9 of 9
